app/Controllers/Barang.php

SELECT *
FROM `barang`
ORDER BY `kode` DESC
---
    public function display()
    {
        $model = new MBarang();
        $data['barang'] = $model->orderBy('kode', 'DESC')->findAll();