app/Models/MBarang.php

DELETE FROM `barang`
WHERE `kode` = 'B004'
---
    public function deleteBarang($id)
    {
        return $this->where('kode', $id)->delete();

INSERT INTO `barang` (`kode`, `nama_barang`, `harga`) VALUES ('b0010', 'Laptop', '10000000')
---
    public function insertBarang($data)
    {
        return $this->insert($data);